DataGatewayLayer/TestApp/Artillery/postAlert.yml
config:
  target: 'http://192.168.0.192:80'
  phases:
    - duration: 1  # Duração da fase de teste em segundos
      arrivalRate: 5  # Taxa de chegada de requisições por segundo
  payload:
    path: "data.csv"
    fields:
      - "id"
      - "IdEdge"
      - "IdNodo"
      - "Hash"
      - "Type"
      - "Date"
      - "Temperatura"
      - "Umidade"
      - "Rele"
      - "Description"
    loadAll: true
    name: alertData

plugins:
  summary:
    module: "artillery-plugin-summary"
    
scenarios:
  - flow:
      - loop:
          - post:
              url: "/alert"
              json:
                id: "{{ $loopElement.id }}"
                idedge: "{{ $loopElement.IdEdge }}"
                idnodo: "{{ $loopElement.IdNodo }}"
                hash: "{{ $loopElement.Hash }}"
                type: "{{ $loopElement.Type }}"
                date: "{{ $loopElement.Date }}"
                temperatura: "{{ String($loopElement.Temperatura) }}"  # Converter para string
                umidade: "{{ String($loopElement.Umidade) }}"  # Converter para string
                rele: "{{ $loopElement.Rele }}"
                description: "{{ $loopElement.Description }}"
        over: alertData
        count: 20  # Número total de requisições simultâneas (usuários virtuais)
engines:
  perVU: 1  # 1 thread por usuário virtual
  maxVUs: 20  # Total de 20 usuários virtuais